[Killed] MethodCallRemoval
Controller/CategoriesController.php:25:9
     {
         $categories = $this->categoryRepository->findAll();
 
-        $this->view->addTemplateParameter('categories', $categories);
+        
         $this->view->setTemplate('HomeView.tpl');
     }
killedBy: App\Test\Controller\CategoriesControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoriesControllerTest::testLoad
Undefined array key "categories"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Core/View.php:23
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/CategoriesControllerTest.php:30

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Controller/CategoriesController.php:26:9
         $categories = $this->categoryRepository->findAll();
 
         $this->view->addTemplateParameter('categories', $categories);
-        $this->view->setTemplate('HomeView.tpl');
+        
     }
 }
killedBy: App\Test\Controller\CategoriesControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoriesControllerTest::testLoad
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'HomeView.tpl'
+'Error.tpl'
