[Killed] CastInt
Controller/CategoryController.php:24:9
 
     public function load(): void
     {
-        $categoryId = (int)($_GET['id'] ?? '');
+        $categoryId = $_GET['id'] ?? '';
 
         $products = $this->productRepository->findByCategoryId($categoryId);
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
TypeError: App\Model\Product\ProductRepository::findByCategoryId(): Argument #1 ($id) must be of type int, string given, called in /home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/CategoryController.php on line 22

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:40
/home/yusuf/PhpstormPr

[Killed] Coalesce
Controller/CategoryController.php:24:9
 
     public function load(): void
     {
-        $categoryId = (int)($_GET['id'] ?? '');
+        $categoryId = (int) ('' ?? $_GET['id']);
 
         $products = $this->productRepository->findByCategoryId($categoryId);
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
Failed asserting that actual size 0 matches expected size 3.

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/CategoryControllerTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Controller/CategoryController.php:28:9
 
         $products = $this->productRepository->findByCategoryId($categoryId);
 
-        $this->view->addTemplateParameter('products', $products);
+        
         $this->view->setTemplate('CategoryView.tpl');
     }
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
Undefined array key "products"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Core/View.php:23
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/CategoryControllerTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Controller/CategoryController.php:29:9
         $products = $this->productRepository->findByCategoryId($categoryId);
 
         $this->view->addTemplateParameter('products', $products);
-        $this->view->setTemplate('CategoryView.tpl');
+        
     }
 }
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'CategoryView.tpl'
+'Error.tpl'
