[Killed] CastInt
Controller/ProductController.php:23:9
 
     public function load(): void
     {
-        $productId = (int)($_GET['id'] ?? '');
+        $productId = $_GET['id'] ?? '';
 
         $product = $this->productRepository->findByProductId($productId);
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
TypeError: App\Model\Product\ProductRepository::findByProductId(): Argument #1 ($id) must be of type int, string given, called in /home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/ProductController.php on line 21

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:58
/home/yusuf/PhpstormProje

[Killed] Coalesce
Controller/ProductController.php:23:9
 
     public function load(): void
     {
-        $productId = (int)($_GET['id'] ?? '');
+        $productId = (int) ('' ?? $_GET['id']);
 
         $product = $this->productRepository->findByProductId($productId);
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to a member function getId() on null

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:33

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Controller/ProductController.php:26:9
         $productId = (int)($_GET['id'] ?? '');
 
         $product = $this->productRepository->findByProductId($productId);
-        $this->view->addTemplateParameter('product', $product);
+        
         $this->view->setTemplate('ProductView.tpl');
 
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Undefined array key "product"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Core/View.php:23
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Controller/ProductController.php:27:9
 
         $product = $this->productRepository->findByProductId($productId);
         $this->view->addTemplateParameter('product', $product);
-        $this->view->setTemplate('ProductView.tpl');
+        
 
     }
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'ProductView.tpl'
+'Error.tpl'
