[Killed] PublicVisibility
Core/Container.php:10:5
 {
     private array $object = [];
 
-    public function set(string $class, object $object): void
+    protected function set(string $class, object $object) : void
     {
         $this->object[$class] = $object;
killedBy: App\Test\Core\ContainerTest::testSet
statusReason: 1) App\Test\Core\ContainerTest::testSet
Error: Call to protected method App\Core\Container::set() from scope App\Test\Core\ContainerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ContainerTest.php:16

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Core/Container.php:15:5
         $this->object[$class] = $object;
     }
 
-    public function get(string $class): object
+    protected function get(string $class) : object
     {
         return $this->object[$class];
killedBy: App\Test\Core\ContainerTest::testSet
statusReason: 1) App\Test\Core\ContainerTest::testSet
Error: Call to protected method App\Core\Container::get() from scope App\Test\Core\ContainerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ContainerTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Core/Container.php:20:5
         return $this->object[$class];
     }
 
-    public function getList(): array
+    protected function getList() : array
     {
         return $this->object;
killedBy: App\Test\Core\ContainerTest::testGetList
statusReason: 1) App\Test\Core\ContainerTest::testGetList
Error: Call to protected method App\Core\Container::getList() from scope App\Test\Core\ContainerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ContainerTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
