[Killed] PublicVisibility
Core/ControllerProvider.php:17:5
     /**
      * @return string[]
      */
-    public function getList(): array
+    protected function getList() : array
     {
         return [
killedBy: App\Test\Core\ControllerProviderTest::testGetList
statusReason: 1) App\Test\Core\ControllerProviderTest::testGetList
Error: Call to protected method App\Core\ControllerProvider::getList() from scope App\Test\Core\ControllerProviderTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ControllerProviderTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ArrayItemRemoval
Core/ControllerProvider.php:19:9
      */
     public function getList(): array
     {
-        return [
-
-            "category" => CategoryController::class,
-
-            "product" => ProductController::class,
-
-            "categories" => CategoriesController::class,
-        ];
+        return ["product" => ProductController::class, "categories" => CategoriesController::class];
     }
 }
killedBy: App\Test\Core\ControllerProviderTest::testGetList
statusReason: 1) App\Test\Core\ControllerProviderTest::testGetList
Undefined array key "category"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ControllerProviderTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
