[Killed] PublicVisibility
Core/DatabaseConnection.php:20:5
     {
     }
 
-    public function getConnection(): PDO
+    protected function getConnection() : PDO
     {
         $this->conn = new PDO("mysql:host=" . $this->host . ";dbname=" . $this->database, $this->username, $this->password);
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
Error: Call to protected method App\Core\DatabaseConnection::getConnection() from scope App\Test\Core\DependencyProviderTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Core/DatabaseConnection.php:22:9
 
     public function getConnection(): PDO
     {
-        $this->conn = new PDO("mysql:host=" . $this->host . ";dbname=" . $this->database, $this->username, $this->password);
+        $this->conn = new PDO("mysql:host=" . $this->host . $this->database . ";dbname=", $this->username, $this->password);
 
         return $this->conn;
killedBy: App\Test\Controller\CategoriesControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoriesControllerTest::testLoad
PDOException: SQLSTATE[3D000]: Invalid catalog name: 1046 No database selected

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Category/CategoryRepository.php:26
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/CategoriesController.php:23
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/Categories

[Killed] ConcatOperandRemoval
Core/DatabaseConnection.php:22:9
 
     public function getConnection(): PDO
     {
-        $this->conn = new PDO("mysql:host=" . $this->host . ";dbname=" . $this->database, $this->username, $this->password);
+        $this->conn = new PDO("mysql:host=" . ";dbname=" . $this->database, $this->username, $this->password);
 
         return $this->conn;
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
PDOException: SQLSTATE[HY000] [2002] No such file or directory

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Core/DatabaseConnection.php:14
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Core/DatabaseConnection.php:27:5
         return $this->conn;
     }
 
-    public function closeConnection(PDO $connection): void
+    protected function closeConnection(PDO $connection) : void
     {
         unset($connection);
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
Error: Call to protected method App\Core\DatabaseConnection::closeConnection() from scope App\Test\Core\DependencyProviderTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:36

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.
