[Killed] PublicVisibility
Core/DependencyProvider.php:12:5
 
 class DependencyProvider
 {
-    public function provide(Container $container, \PDO $PDO, \Smarty $smarty): void
+    protected function provide(Container $container, \PDO $PDO, \Smarty $smarty) : void
     {
         $container->set(View::class, new View($smarty));
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
Error: Call to protected method App\Core\DependencyProvider::provide() from scope App\Test\Core\DependencyProviderTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:14:9
 {
     public function provide(Container $container, \PDO $PDO, \Smarty $smarty): void
     {
-        $container->set(View::class, new View($smarty));
+        
 
         //Repository's
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
Undefined array key "App\Core\View"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:32

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:17:9
         $container->set(View::class, new View($smarty));
 
         //Repository's
-        $container->set(CategoryRepository::class, new CategoryRepository(new CategoryMapper(), $PDO));
+        
         $container->set(ProductRepository::class, new ProductRepository(new ProductMapper(), $PDO));
 
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
Undefined array key "App\Model\Category\CategoryRepository"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:33

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] MethodCallRemoval
Core/DependencyProvider.php:18:9
 
         //Repository's
         $container->set(CategoryRepository::class, new CategoryRepository(new CategoryMapper(), $PDO));
-        $container->set(ProductRepository::class, new ProductRepository(new ProductMapper(), $PDO));
+        
 
     }
killedBy: App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
statusReason: 1) App\Test\Core\DependencyProviderTest::testProvideMethodAddsClassesToContainer
Undefined array key "App\Model\Product\ProductRepository"

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/DependencyProviderTest.php:34

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.
