[Killed] PublicVisibility
Core/View.php:16:5
     {
     }
 
-    public function addTemplateParameter(string $key, mixed $value): void
+    protected function addTemplateParameter(string $key, mixed $value) : void
     {
         $this->params[$key] = $value;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Core\View::addTemplateParameter() from scope App\Controller\ProductController

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/ProductController.php:26
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:29

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Core/View.php:21:5
         $this->params[$key] = $value;
     }
 
-    public function getTemplateParameter(string $key): mixed
+    protected function getTemplateParameter(string $key) : mixed
     {
         return $this->params[$key];
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Core\View::getTemplateParameter() from scope App\Test\Controller\ProductControllerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Core/View.php:26:5
         return $this->params[$key];
     }
 
-    public function setTemplate(string $template): void
+    protected function setTemplate(string $template) : void
     {
         if(!str_contains($template, '.tpl')) {
killedBy: App\Test\Core\ViewTest::testSetTemplate
statusReason: 1) App\Test\Core\ViewTest::testSetTemplate
Error: Call to protected method App\Core\View::setTemplate() from scope App\Test\Core\ViewTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ViewTest.php:15

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Core/View.php:28:9
 
     public function setTemplate(string $template): void
     {
-        if(!str_contains($template, '.tpl')) {
+        if (str_contains($template, '.tpl')) {
             $template .= '.tpl';
         }
killedBy: App\Test\Core\ViewTest::testSetTemplate
statusReason: 1) App\Test\Core\ViewTest::testSetTemplate
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'test.tpl'
+'test'

[Killed] Assignment
Core/View.php:29:13
     public function setTemplate(string $template): void
     {
         if(!str_contains($template, '.tpl')) {
-            $template .= '.tpl';
+            $template = '.tpl';
         }
 
killedBy: App\Test\Core\ViewTest::testSetTemplate
statusReason: 1) App\Test\Core\ViewTest::testSetTemplate
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'test.tpl'
+'.tpl'

[Killed] PublicVisibility
Core/View.php:46:5
         $this->smarty->display($this->template);
     }
 
-    public function getTemplate(): string
+    protected function getTemplate() : string
     {
         return $this->template;
killedBy: App\Test\Core\ViewTest::testSetTemplate
statusReason: 1) App\Test\Core\ViewTest::testSetTemplate
Error: Call to protected method App\Core\View::getTemplate() from scope App\Test\Core\ViewTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Core/ViewTest.php:16

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
