[Killed] PublicVisibility
Model/Category/CategoryMapper.php:11:5
 class CategoryMapper
 {
 
-    public function map(array $category): CategoryDTO
+    protected function map(array $category) : CategoryDTO
     {
         $categoryDTO = new CategoryDTO();
killedBy: App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
statusReason: 1) App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
Error: Call to protected method App\Model\Category\CategoryMapper::map() from scope App\Test\Model\Category\CategoryMapperTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryMapperTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Model/Category/CategoryMapper.php:15:9
     {
         $categoryDTO = new CategoryDTO();
 
-        $categoryDTO->setId($category['ID']);
+        
         $categoryDTO->setName($category['name']);
         $categoryDTO->setDesignation($category['desgination']);
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Typed property App\Model\DTO\CategoryDTO::$id must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/CategoryDTO.php:15
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:23

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] MethodCallRemoval
Model/Category/CategoryMapper.php:16:9
         $categoryDTO = new CategoryDTO();
 
         $categoryDTO->setId($category['ID']);
-        $categoryDTO->setName($category['name']);
+        
         $categoryDTO->setDesignation($category['desgination']);
 
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Typed property App\Model\DTO\CategoryDTO::$name must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/CategoryDTO.php:32
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:27

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.

[Killed] MethodCallRemoval
Model/Category/CategoryMapper.php:17:9
 
         $categoryDTO->setId($category['ID']);
         $categoryDTO->setName($category['name']);
-        $categoryDTO->setDesignation($category['desgination']);
+        
 
         return $categoryDTO;
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Typed property App\Model\DTO\CategoryDTO::$designation must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/CategoryDTO.php:48
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:31

ERRORS!
Tests: 1, Assertions: 7, Errors: 1.
