[Killed] PublicVisibility
Model/Category/CategoryRepository.php:21:5
     /**
      * @return CategoryDTO[]
      */
-    public function findAll(): array
+    protected function findAll() : array
     {
         $statement = $this->PDO
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Call to protected method App\Model\Category\CategoryRepository::findAll() from scope App\Test\Model\Category\CategoryRepositoryTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
Model/Category/CategoryRepository.php:33:9
 
         $categoryList = [];
 
-        foreach ($results as $result) {
-            $categoryList[] = $this->categorymapper->map($result);
-        }
+        foreach (array() as $result) {
 
         return $categoryList;
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Failed asserting that actual size 0 matches expected size 3.

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
