[Killed] PublicVisibility
Model/DTO/CategoryDTO.php:13:5
     /**
      * @return int
      */
-    public function getId(): int
+    protected function getId() : int
     {
         return $this->id;
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Call to protected method App\Model\DTO\CategoryDTO::getId() from scope App\Test\Model\Category\CategoryRepositoryTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:23

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Model/DTO/CategoryDTO.php:22:5
     /**
      * @param int $id
      */
-    public function setId(int $id): void
+    protected function setId(int $id) : void
     {
         $this->id = $id;
killedBy: App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
statusReason: 1) App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
Error: Call to protected method App\Model\DTO\CategoryDTO::setId() from scope App\Model\Category\CategoryMapper

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Category/CategoryMapper.php:15
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryMapperTest.php:21

ERRORS!
Tests: 1, Assertion

[Killed] PublicVisibility
Model/DTO/CategoryDTO.php:30:5
     /**
      * @return string
      */
-    public function getName(): string
+    protected function getName() : string
     {
         return $this->name;
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Call to protected method App\Model\DTO\CategoryDTO::getName() from scope App\Test\Model\Category\CategoryRepositoryTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:27

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
Model/DTO/CategoryDTO.php:38:5
     /**
      * @param string $name
      */
-    public function setName(string $name): void
+    protected function setName(string $name) : void
     {
         $this->name = $name;
killedBy: App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
statusReason: 1) App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
Error: Call to protected method App\Model\DTO\CategoryDTO::setName() from scope App\Model\Category\CategoryMapper

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Category/CategoryMapper.php:16
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryMapperTest.php:21

ERRORS!
Tests: 1, Asserti

[Killed] PublicVisibility
Model/DTO/CategoryDTO.php:46:5
     /**
      * @return string
      */
-    public function getDesignation(): string
+    protected function getDesignation() : string
     {
         return $this->designation;
killedBy: App\Test\Model\Category\CategoryRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Category\CategoryRepositoryTest::testFindAll
Error: Call to protected method App\Model\DTO\CategoryDTO::getDesignation() from scope App\Test\Model\Category\CategoryRepositoryTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryRepositoryTest.php:31

ERRORS!
Tests: 1, Assertions: 7, Errors: 1.

[Killed] PublicVisibility
Model/DTO/CategoryDTO.php:54:5
     /**
      * @param string $designation
      */
-    public function setDesignation(string $designation): void
+    protected function setDesignation(string $designation) : void
     {
         $this->designation = $designation;
killedBy: App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
statusReason: 1) App\Test\Model\Category\CategoryMapperTest::testMapReturnsCategoryDTO
Error: Call to protected method App\Model\DTO\CategoryDTO::setDesignation() from scope App\Model\Category\CategoryMapper

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Category/CategoryMapper.php:17
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Category/CategoryMapperTest.php:21

ERRORS!
Tests: 1,
