[Killed] PublicVisibility
Model/DTO/ProductDTO.php:49:5
     /**
      * @return string
      */
-    public function getDescription(): string
+    protected function getDescription() : string
     {
         return $this->description;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\DTO\ProductDTO::getDescription() from scope App\Test\Controller\ProductControllerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:36

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Killed] PublicVisibility
Model/DTO/ProductDTO.php:57:5
     /**
      * @param string $description
      */
-    public function setDescription(string $description): void
+    protected function setDescription(string $description) : void
     {
         $this->description = $description;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\DTO\ProductDTO::setDescription() from scope App\Model\Product\ProductMapper

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductMapper.php:18
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:70
/home/yusuf/PhpstormProjects/shopixmvc/shopixm

[Killed] PublicVisibility
Model/DTO/ProductDTO.php:65:5
     /**
      * @return int
      */
-    public function getCategoryId(): int
+    protected function getCategoryId() : int
     {
         return $this->categoryId;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\DTO\ProductDTO::getCategoryId() from scope App\Test\Controller\ProductControllerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:35

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
Model/DTO/ProductDTO.php:73:5
     /**
      * @param int $categoryId
      */
-    public function setCategoryId(int $categoryId): void
+    protected function setCategoryId(int $categoryId) : void
     {
         $this->categoryId = $categoryId;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\DTO\ProductDTO::setCategoryID() from scope App\Model\Product\ProductMapper

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductMapper.php:19
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:70
/home/yusuf/PhpstormProjects/shopixmvc/shopixmv

[Killed] PublicVisibility
Model/DTO/ProductDTO.php:81:5
     /**
      * @return float
      */
-    public function getPrice(): float
+    protected function getPrice() : float
     {
         return $this->price;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\DTO\ProductDTO::getPrice() from scope App\Test\Controller\ProductControllerTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:37

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
Model/DTO/ProductDTO.php:89:5
     /**
      * @param float $price
      */
-    public function setPrice(float $price): void
+    protected function setPrice(float $price) : void
     {
         $this->price = $price;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\DTO\ProductDTO::setPrice() from scope App\Model\Product\ProductMapper

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductMapper.php:20
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:70
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src
