[Killed] PublicVisibility
Model/Product/ProductMapper.php:12:5
 
 class ProductMapper
 {
-    public function map(array $productList): ProductDTO
+    protected function map(array $productList) : ProductDTO
     {    
         $productDTO = new ProductDTO();
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\Product\ProductMapper::map() from scope App\Model\Product\ProductRepository

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:70
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/ProductController.php:25
/home/yusuf/PhpstormProjects/shopixmvc/shopix

[Killed] MethodCallRemoval
Model/Product/ProductMapper.php:16:9
     {    
         $productDTO = new ProductDTO();
 
-        $productDTO->setId($productList['ID']);
+        
         $productDTO->setName($productList['name']);
         $productDTO->setDescription($productList['description']);
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Typed property App\Model\DTO\ProductDTO::$id must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/ProductDTO.php:19
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:33

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Model/Product/ProductMapper.php:17:9
         $productDTO = new ProductDTO();
 
         $productDTO->setId($productList['ID']);
-        $productDTO->setName($productList['name']);
+        
         $productDTO->setDescription($productList['description']);
         $productDTO->setCategoryID($productList['categoryId']);
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Typed property App\Model\DTO\ProductDTO::$name must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/ProductDTO.php:35
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:34

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] MethodCallRemoval
Model/Product/ProductMapper.php:18:9
 
         $productDTO->setId($productList['ID']);
         $productDTO->setName($productList['name']);
-        $productDTO->setDescription($productList['description']);
+        
         $productDTO->setCategoryID($productList['categoryId']);
         $productDTO->setPrice($productList["price"]);
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Typed property App\Model\DTO\ProductDTO::$description must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/ProductDTO.php:51
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:36

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Killed] MethodCallRemoval
Model/Product/ProductMapper.php:19:9
         $productDTO->setId($productList['ID']);
         $productDTO->setName($productList['name']);
         $productDTO->setDescription($productList['description']);
-        $productDTO->setCategoryID($productList['categoryId']);
+        
         $productDTO->setPrice($productList["price"]);
 
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Typed property App\Model\DTO\ProductDTO::$categoryId must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/ProductDTO.php:67
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:35

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] MethodCallRemoval
Model/Product/ProductMapper.php:20:9
         $productDTO->setName($productList['name']);
         $productDTO->setDescription($productList['description']);
         $productDTO->setCategoryID($productList['categoryId']);
-        $productDTO->setPrice($productList["price"]);
+        
 
         return $productDTO;
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Typed property App\Model\DTO\ProductDTO::$price must not be accessed before initialization

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/DTO/ProductDTO.php:83
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:37

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.
