[Killed] PublicVisibility
Model/Product/ProductRepository.php:18:5
     {
     }
 
-    public function findAll(): array
+    protected function findAll() : array
     {
         $statement = $this->PDO
killedBy: App\Test\Model\Product\ProductRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Product\ProductRepositoryTest::testFindAll
Error: Call to protected method App\Model\Product\ProductRepository::findAll() from scope App\Test\Model\Product\ProductRepositoryTest

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Product/ProductRepositoryTest.php:18

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Model/Product/ProductRepository.php:22:9
     {
         $statement = $this->PDO
             ->prepare('SELECT * FROM products');
-        $statement->execute();
+        
 
         $results = $statement
killedBy: App\Test\Model\Product\ProductRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Product\ProductRepositoryTest::testFindAll
Failed asserting that actual size 0 matches expected size 9.

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Product/ProductRepositoryTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Model/Product/ProductRepository.php:29:9
 
         $productList = [];
 
-        foreach ($results as $result) {
-            $productList[] = $this->productMapper->map($result);
-        }
+        foreach (array() as $result) {
 
         return $productList;
killedBy: App\Test\Model\Product\ProductRepositoryTest::testFindAll
statusReason: 1) App\Test\Model\Product\ProductRepositoryTest::testFindAll
Failed asserting that actual size 0 matches expected size 9.

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Model/Product/ProductRepositoryTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Model/Product/ProductRepository.php:40:5
      * @param int $id
      * @return ProductDTO[]
      */
-    public function findByCategoryId(int $id): array
+    protected function findByCategoryId(int $id) : array
     {
         $statement = $this->PDO
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
Error: Call to protected method App\Model\Product\ProductRepository::findByCategoryId() from scope App\Controller\CategoryController

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/CategoryController.php:26
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/CategoryControllerTest.php:29

ERRORS!
Tests: 1, Asser

[Killed] ConcatOperandRemoval
Model/Product/ProductRepository.php:43:13
     public function findByCategoryId(int $id): array
     {
         $statement = $this->PDO
-            ->prepare('SELECT * FROM products WHERE categoryId = ' . $id);
+            $statement = $this->PDO->prepare($id);
 
         $statement->execute();
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
TypeError: PDO::prepare(): Argument #1 ($query) must be of type string, int given

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:30
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/CategoryController.php:26
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/CategoryContr

[Killed] Concat
Model/Product/ProductRepository.php:43:13
     public function findByCategoryId(int $id): array
     {
         $statement = $this->PDO
-            ->prepare('SELECT * FROM products WHERE categoryId = ' . $id);
+            $statement = $this->PDO->prepare($id . 'SELECT * FROM products WHERE categoryId = ');
 
         $statement->execute();
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '1SELECT * FROM products WHERE categoryId =' at line 1

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository

[Killed] Foreach_
Model/Product/ProductRepository.php:51:9
 
         $productsList = [];
 
-        foreach ($results as $product) {
-            $productsList[] = $this->productMapper->map($product);
-        }
+        foreach (array() as $product) {
 
         return $productsList;
killedBy: App\Test\Controller\CategoryControllerTest::testLoad
statusReason: 1) App\Test\Controller\CategoryControllerTest::testLoad
Failed asserting that actual size 0 matches expected size 3.

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/CategoryControllerTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Model/Product/ProductRepository.php:58:5
         return $productsList;
     }
 
-    public function findByProductId(int $id): ?ProductDTO
+    protected function findByProductId(int $id) : ?ProductDTO
     {
         $statement = $this->PDO
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to protected method App\Model\Product\ProductRepository::findByProductId() from scope App\Controller\ProductController

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/ProductController.php:25
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:29

ERRORS!
Tests: 1, Assertions

[Killed] ConcatOperandRemoval
Model/Product/ProductRepository.php:61:13
     public function findByProductId(int $id): ?ProductDTO
     {
         $statement = $this->PDO
-            ->prepare('SELECT * FROM products WHERE ID = ' . $id);
+            $statement = $this->PDO->prepare('SELECT * FROM products WHERE ID = ');
 
         $statement->execute();
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 1

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:42
/home/yusuf/PhpstormProjects/shopix

[Killed] ConcatOperandRemoval
Model/Product/ProductRepository.php:61:13
     public function findByProductId(int $id): ?ProductDTO
     {
         $statement = $this->PDO
-            ->prepare('SELECT * FROM products WHERE ID = ' . $id);
+            $statement = $this->PDO->prepare($id);
 
         $statement->execute();
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
TypeError: PDO::prepare(): Argument #1 ($query) must be of type string, int given

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php:41
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Controller/ProductController.php:25
/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControll

[Killed] FalseValue
Model/Product/ProductRepository.php:66:9
         $statement->execute();
         $results = $statement->fetch(\PDO::FETCH_ASSOC);
 
-        if ($results === false) {
+        if ($results === true) {
             return null;
         }
killedBy: App\Test\Model\Product\ProductRepositoryTest::testFindByProductIDNegativ
statusReason: 1) App\Test\Model\Product\ProductRepositoryTest::testFindByProductIDNegativ
TypeError: App\Model\Product\ProductMapper::map(): Argument #1 ($productList) must be of type array, bool given, called in /home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductRepository.php on line 47

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/src/Model/Product/ProductMapper.php:12
/home/yusuf/

[Killed] Identical
Model/Product/ProductRepository.php:66:9
         $statement->execute();
         $results = $statement->fetch(\PDO::FETCH_ASSOC);
 
-        if ($results === false) {
+        if ($results !== false) {
             return null;
         }
killedBy: App\Test\Controller\ProductControllerTest::testLoad
statusReason: 1) App\Test\Controller\ProductControllerTest::testLoad
Error: Call to a member function getId() on null

/home/yusuf/PhpstormProjects/shopixmvc/shopixmvc/tests/Controller/ProductControllerTest.php:33

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
